app/controllers/games_controller.rb

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @game = Game.find(params[:id])

INSERT INTO "games" ("number", "title", "weight", "owner", "borrower", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["number", 101], ["title", "Once Upon A Time"], ["weight", 160], ["owner", "Erik"], ["borrower", "0223"], ["created_at", "2015-08-12 17:52:49.858820"], ["updated_at", "2015-08-12 17:52:49.858820"]]
---
  def create
    #@game = Game.new(params.require(:game).permit(:number, :title, :weight, :owner, :borrower))
    @game = Game.new(game_params)

    if @game.save

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "games" SET "borrowed" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["borrowed", "t"], ["updated_at", "2015-08-13 12:21:59.667057"], ["id", 1]]
---
  def update
    @game = Game.find(params[:id])

    if @game.update(game_params)

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 1]]
---
def destroy
    @game = Game.find(params[:id])
      @game.destroy